<?php

return array(
    0 => array(
        'title' => 'আবেদনের বিষয়',
        'type' => 'select',
        'class' => 'app_subject',
        'name' => 'subject',
        'options' => array(
            'ঘর ‘ক’ (ভূমিহীন ও গৃহহীন)' => 'ঘর ‘ক’ (ভূমিহীন ও গৃহহীন)',
            'ঘর ‘খ’ ( সর্বোচ্চ ১০ শতাংশ জমি আছে কিন্তু ঘর নেই )' => 'ঘর ‘খ’ ( সর্বোচ্চ ১০ শতাংশ জমি আছে কিন্তু ঘর নেই )',
            'গভীর নলকূপ' => 'গভীর নলকূপ',
            'ঢেউটিন' => 'ঢেউটিন',
            'টি.আর' => 'টি.আর',
            'কাবিখা/ কাবিটা' => 'কাবিখা/ কাবিটা',
            'বার্ষিক উন্নয়ন কমসূচী (এডিপি)' => 'বার্ষিক উন্নয়ন কমসূচী (এডিপি)',
            'আর্থিক অনুদান (চিকিৎসা)' => 'আর্থিক অনুদান (চিকিৎসা)',
            'কম্বলের আবেদন' => 'কম্বলের আবেদন',
            'বিবিধ' => 'বিবিধ',
            'বয়স্ক ভাতা' => 'বয়স্ক ভাতা',
            'বিধবা/স্বামী পরিত্যাক্ত ভাতা' => 'বিধবা/স্বামী পরিত্যাক্ত ভাতা',
            'প্রতিবন্ধী ভাতা' => 'প্রতিবন্ধী ভাতা',
            'মার্তৃত্বকালীন ভাতা' => 'মার্তৃত্বকালীন ভাতা'
        ),
        'isHidden' => false,
//        'onchange' => "showOption('.app_subject', {'বিবিধ' : '.others', 'ভাতা' : '.vata'})"
    ),
    1 => array(
        'title' => '',
        'type' => 'text',
        'class' => 'others',
        'name' => 'others',
        'isHidden' => true
    ),
//    2 => array(
//        'title' => '',
//        'type' => 'select',
//        'class' => 'vata',
//        'name' => 'vata',
//        'options' => array(
//            'বয়স্ক ভাতা',
//            'বিধবা/স্বামী পরিত্যাক্ত ভাতা',
//            'প্রতিবন্ধী ভাতা',
//            'মার্তৃত্বকালীন ভাতা'
//        ),
//        'isHidden' => true
//    ),
    2 => array(
        'title' => 'বরাবর',
        'type' => 'select',
        'class' => 'app_to',
        'name' => 'to',
        'options' => array(
            'চেয়ারম্যান, উপজেলা পরিষদ।',
            'উপজেলা নির্বাহী অফিসার।',
            'ভাইস চেয়ারম্যান',
            'মহিলা ভাইস চেয়ারম্যান',
            'চেয়ারম্যান, সয়না রঘুনাথপুর ইউনিয়ন পরিষদ',
            'চেয়ারম্যান, আমরাজুড়ী ইউনিয়ন পরিষদ',
            'চেয়ারম্যান, কাউখালী সদর ইউনিয়ন পরিষদ',
            'চেয়ারম্যান, চিরাপাড়া পারসাতুরিয়া ইউনিয়ন পরিষদ',
            'চেয়ারম্যান, শিয়ালকাঠী ইউনিয়ন পরিষদ'
        ),
        'isHidden' => false
    )
);
